Revit 2024 API
FailuresAccessor.IsFailureResolutionPermitted Method
 Checks if resolution of failures is permitted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool IsFailureResolutionPermitted()
Visual Basic
Public Function IsFailureResolutionPermitted As Boolean
Visual C++
public:
bool IsFailureResolutionPermitted()
Return Value
 True if resolutions of failures is permitted.
See Also
FailuresAccessor Class
IsFailureResolutionPermitted Overload
Autodesk.Revit.DB Namespace